tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "oven-sh/bun"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "apr-util"
brew "awscli"
brew "bats-core"
brew "freetype"
brew "fontconfig"
brew "pcre2"
brew "libssh2"
brew "rtmpdump"
brew "curl"
brew "freetds"
brew "libavif"
brew "gd"
brew "libpq"
brew "cowsay"
brew "dialog"
brew "dive"
brew "docker", link: false
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "openssl@1.1"
brew "emacs", link: false
brew "exercism"
brew "fd"
brew "fortune"
brew "fzf"
brew "gawk"
brew "git"
brew "git-crypt"
brew "gnu-getopt"
brew "gnupg"
brew "htop"
brew "httpd"
brew "jq"
brew "libfido2"
brew "mkcert"
brew "mysql"
brew "neovim", args: ["HEAD"]
brew "nss"
brew "pinentry-mac"
brew "pnpm"
brew "postgresql@14"
brew "protobuf"
brew "pyenv"
brew "rabbitmq-c"
brew "redis"
brew "ripgrep"
brew "shellcheck"
brew "sl"
brew "socat"
brew "sops"
brew "stow"
brew "tmux"
brew "tree"
brew "zsh"
brew "zsh-autosuggestions"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp"]
brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "oven-sh/bun/bun"
cask "brave-browser"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "insomnia"
cask "iterm2-beta"
cask "kap"
cask "ngrok"
cask "qlmarkdown"
cask "rectangle"
cask "visual-studio-code"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "jdinhlife.gruvbox"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "vscodevim.vim"
vscode "zixuanchen.vitest-explorer"
